javascript_modelo_datos_1.reveal.org
#+title: Modelo de datos de JavaScript (I)
#+setupfile: setup.org


* Fundamentos de los lenguajes
:PROPERTIES:
:CUSTOM_ID: fundamentos-de-los-lenguajes
:END:

#+REVEAL: split

Lenguaje de programación = sintaxis + modelo de datos + modelo de
ejecución

(+ estilo)

#+REVEAL: split

- La [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference#Statements][sintaxis]] es vuestra responsabilidad
- El modelo de datos es mía
- El modelo de ejecución también
- Y la jerga es de ambos

* Experimentando con JavaScript
:PROPERTIES:
:CUSTOM_ID: experimentando-con-javascript
:END:

#+REVEAL: split

Vamos a experimentar con JavaScript así que necesitamos una forma rápida
de inspeccionar expresiones y obtener feedback de lo que estamos
haciendo

La mejor forma es utilizar la consola de /node/:

#+begin_src sh
$ node --use_strict
#+end_src

#+REVEAL: split

La opción =--use_strict= activa el modo estricto de JavaScript que
simplifica algunos aspectos del lenguaje

Recorta algunas características pero los beneficios son mayores que las
pérdidas

#+REVEAL: split

Ahora puedes probar a introducir algunas expresiones:

#+begin_src js
> 40 + 2
42
> let point = { x: 1, y: 1 };
undefined
> point
{ x: 1, y: 1 }
> point.x
1
#+end_src

#+REVEAL: split

Para limpiar la pantalla presiona =ctrl+l=

Para salir de /node/, presiona =ctrl+c= dos veces seguidas

#+REVEAL: split

Si no quieres lidiar con la consola de /node/, siempre puedes escribir
un programa y usar =console.log()= para mostrar expresiones por pantalla

#+begin_src js
// en prueba.js
console.log(40 + 2);
let point = { x: 1, y: 1 };
console.log(point);
console.log('Coordenada X:', point.x);
#+end_src

#+REVEAL: split

Y ahora ejecutar el programa con node:

#+begin_src sh
$ node prueba.js
42
{ x: 1, y: 1 }
Coordenada X: 1
#+end_src

#+REVEAL: split

El tema asume una única sesión de la consola de /node/ a menos que se
indique lo contrario

Esto es importante porque /el estado se guarda entre instrucciones/

#+REVEAL: split

Para la mayoría de los ejemplos, puedes mantener la misma sesión abierta
pero si te encuentras con algo inesperado, antes de nada prueba a
reiniciar la consola

Para reiniciar la consola tienes que *salir y volver a entrar*

Lo mejor es que se tenga la presentación abierta a un lado y la consola
/node/ en el otro

* Peculiaridades de la sintaxis
:PROPERTIES:
:CUSTOM_ID: peculiaridades-de-la-sintaxis
:END:

#+REVEAL: split

Las instrucciones acaban en =;=

...pero puedes no usarlo

#+begin_src js
return     // intérprete añade ; y devuelve undefined
a + b      // Se hace la suma pero se pierde en el limbo

return     // intérprete añade ; y devuelve undefined
{ a: 5 }   // Se crea el objeto pero se pierde en el limbo

return {
  a : 5
}          // Devuelve el objeto creado
#+end_src

#+REVEAL: split

Vamos a declarar las variables con =let= o =const=:

- =let=: Declara una variable de bloque
- =const=: Declara una variable cuyo /valor/ no puede ser cambiado

#+begin_src js
let b = 5;
b = "Hola";             // Permitido
const a = {};
a.nombre = "mi nombre"; // Permitido
a = {};                 // ERROR: No permitido
#+end_src

#+REVEAL: split

Veréis que también se pueden difinir variables con:

- =var=: Variables globales o de función. Realizan /hoisting/
- Sin ninguna palabra clave delante: variables globales

#+begin_quote
*No las usaremos en este curso (salvo que nos lo justifiquéis
adecuadamente)*

#+end_quote

Cuando veamos el modelo de ejecución, veremos por qué

** Una *letiable es un nombre*
:PROPERTIES:
:CUSTOM_ID: una-letiable-es-un-nombre
:END:
Para el programa, quitando algunas excepciones, los nombres no tienen
significado



** Un *valor no es un nombre*
:PROPERTIES:
:CUSTOM_ID: un-valor-no-es-un-nombre
:END:
De hecho, sólo las funciones pueden tener nombre para poder implementar
recursividad

#+REVEAL: split

Así que no es lo mismo el nombre =uno= que el valor =1=, y por supuesto,
no es obligatoria ninguna relación coherente entre el nombre y el valor

#+begin_src js
let uno = 2; // para el programa tiene sentido. Puede que para el programador no
#+end_src

#+REVEAL: split

En general, hablando de booleanos, cadenas y números, decimos que los
*nombres guardan valores*

Si hablamos de objetos y funciones decimos que los *nombres apuntan a
objetos o funciones* o *son referencias a objetos o funciones*

** Cadenas de caracteres (string)
:PROPERTIES:
:CUSTOM_ID: cadenas-de-caracteres-string
:END:
- Cadenas simples entre =" "= ó =' '=
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals%3E][Cadenas
  de plantilla]] entre ` `

#+begin_src js
let s1 = 5;
let s2 = 10;
console.log(`La suma de ${s1} y ${s2} es ${s1 + s2}.`);

// La suma de 5 y 10 es 15.
#+end_src

En C# se conoce como cadenas interpoladas

* Tipos primitivos
:PROPERTIES:
:CUSTOM_ID: tipos-primitivos
:END:

#+REVEAL: split

Se llama *tipos primitivos* a aquellos que vienen con el lenguaje y que
permiten la creación de nuevos tipos más complejos


** Tipos primitivos
:PROPERTIES:
:CUSTOM_ID: tipos-primitivos-1
:END:
- booleanos
- undefined
- números
- cadenas
- enteros grandes
- símbolos


** Objetos y =null=
:PROPERTIES:
:CUSTOM_ID: objetos-y-null
:END:
Los objetos en JS son "no primitivos"

Tienen /datos/ y /métodos/

=null= es un tipo, aunque =typeof null === "object"=


** Funciones
:PROPERTIES:
:CUSTOM_ID: funciones
:END:
Las funciones se representan por su propio tipo, aunque también son
=object=

=typeof f === "function"=

Tienen la propiedad de ser "llamables" (/callable/)

#+REVEAL: split

#+begin_src js
// En los comentarios hay más valores posibles para cada uno de los tipos
let bool = true; // false
let number = 1234.5; // 42, -Infinity, +Infinity
let text = 'I want to be a pirate!'; // "I want to be a pirate"
let object = {}; // [], null
let code = function () { return 42; };
#+end_src

#+REVEAL: split

Los puedes reconocer porque responden de manera distinta al operador
=typeof=:

#+begin_src js
typeof true;
typeof 1234.5;
typeof 'I want to be a pirate!';
typeof {};
typeof function () { return 42; };
#+end_src

#+REVEAL: split

En JavaScript podemos declarar una letiable y no asignarle ningún valor.
En este caso el tipo de la letiable será =undefined=

#+begin_src js
let x;
typeof x; // undefined
x = 5;    // tan pronto como le demos un valor, el tipo dejará de ser undefined
typeof x; // number
#+end_src

