docs/javascript_modelo_datos_1.reveal.html
<!DOCTYPE html><html lang="es"><head><meta charset="utf-8"><title>Modelo de datos de JavaScript (I)</title><meta name="author" content="Carlos León"><link rel="stylesheet" href="tooling.reveal.e38fa0d8.css"><link rel="stylesheet" href="tooling.reveal.a866bf8d.css" id="theme"><link rel="stylesheet" href="tooling.reveal.c1a625de.css"><link rel="stylesheet" href="tooling.reveal.fdb16a0d.css"></head><body> <div class="reveal"> <div class="slides"> <section id="sec-title-slide"> <h1 class="title">Modelo de datos de JavaScript (I)</h1><h2 class="author">Carlos León</h2><h2 class="email"><a href="mailto:cleon@fedora">cleon@fedora</a></h2> </section> <section> <section id="slide-fundamentos-de-los-lenguajes"> <h2 id="fundamentos-de-los-lenguajes">Fundamentos de los lenguajes</h2> </section> <section> <p> Lenguaje de programación = sintaxis + modelo de datos + modelo de ejecución </p> <p> (+ estilo) </p> </section> <section> <ul> <li>La <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference#Statements">sintaxis</a> es vuestra responsabilidad</li> <li>El modelo de datos es mía</li> <li>El modelo de ejecución también</li> <li>Y la jerga es de ambos</li> </ul> </section> </section> <section> <section id="slide-experimentando-con-javascript"> <h2 id="experimentando-con-javascript">Experimentando con JavaScript</h2> </section> <section> <p> Vamos a experimentar con JavaScript así que necesitamos una forma rápida de inspeccionar expresiones y obtener feedback de lo que estamos haciendo </p> <p> La mejor forma es utilizar la consola de <i>node</i>: </p> <div class="org-src-container"> <pre><code class="sh">$ node --use_strict
</code></pre> </div> </section> <section> <p> La opción <code>--use_strict</code> activa el modo estricto de JavaScript que simplifica algunos aspectos del lenguaje </p> <p> Recorta algunas características pero los beneficios son mayores que las pérdidas </p> </section> <section> <p> Ahora puedes probar a introducir algunas expresiones: </p> <div class="org-src-container"> <pre><code class="js">&gt; 40 + 2
42
&gt; let point = { x: 1, y: 1 };
undefined
&gt; point
{ x: 1, y: 1 }
&gt; point.x
1
</code></pre> </div> </section> <section> <p> Para limpiar la pantalla presiona <code>ctrl+l</code> </p> <p> Para salir de <i>node</i>, presiona <code>ctrl+c</code> dos veces seguidas </p> </section> <section> <p> Si no quieres lidiar con la consola de <i>node</i>, siempre puedes escribir un programa y usar <code>console.log()</code> para mostrar expresiones por pantalla </p> <div class="org-src-container"> <pre><code class="js">// en prueba.js
console.log(40 + 2);
let point = { x: 1, y: 1 };
console.log(point);
console.log('Coordenada X:', point.x);
</code></pre> </div> </section> <section> <p> Y ahora ejecutar el programa con node: </p> <div class="org-src-container"> <pre><code class="sh">$ node prueba.js
42
{ x: 1, y: 1 }
Coordenada X: 1
</code></pre> </div> </section> <section> <p> El tema asume una única sesión de la consola de <i>node</i> a menos que se indique lo contrario </p> <p> Esto es importante porque <i>el estado se guarda entre instrucciones</i> </p> </section> <section> <p> Para la mayoría de los ejemplos, puedes mantener la misma sesión abierta pero si te encuentras con algo inesperado, antes de nada prueba a reiniciar la consola </p> <p> Para reiniciar la consola tienes que <b>salir y volver a entrar</b> </p> <p> Lo mejor es que se tenga la presentación abierta a un lado y la consola <i>node</i> en el otro </p> </section> </section> <section> <section id="slide-peculiaridades-de-la-sintaxis"> <h2 id="peculiaridades-de-la-sintaxis">Peculiaridades de la sintaxis</h2> </section> <section> <p> Las instrucciones acaban en <code>;</code> </p> <p> &#x2026;pero puedes no usarlo </p> <div class="org-src-container"> <pre><code class="js">return     // intérprete añade ; y devuelve undefined
a + b      // Se hace la suma pero se pierde en el limbo

return     // intérprete añade ; y devuelve undefined
{ a: 5 }   // Se crea el objeto pero se pierde en el limbo

return {
  a : 5
}          // Devuelve el objeto creado
</code></pre> </div> </section> <section> <p> Vamos a declarar las variables con <code>let</code> o <code>const</code>: </p> <ul> <li><code>let</code>: Declara una variable de bloque</li> <li><code>const</code>: Declara una variable cuyo <i>valor</i> no puede ser cambiado</li> </ul> <div class="org-src-container"> <pre><code class="js">let b = 5;
b = "Hola";             // Permitido
const a = {};
a.nombre = "mi nombre"; // Permitido
a = {};                 // ERROR: No permitido
</code></pre> </div> </section> <section> <p> Veréis que también se pueden difinir variables con: </p> <ul> <li><code>var</code>: Variables globales o de función. Realizan <i>hoisting</i></li> <li>Sin ninguna palabra clave delante: variables globales</li> </ul> <blockquote> <p> <b>No las usaremos en este curso (salvo que nos lo justifiquéis adecuadamente)</b> </p> </blockquote> <p> Cuando veamos el modelo de ejecución, veremos por qué </p> </section> <section id="slide-una-letiable-es-un-nombre"> <h3 id="una-letiable-es-un-nombre">Una <b>letiable es un nombre</b></h3> <p> Para el programa, quitando algunas excepciones, los nombres no tienen significado </p> </section> <section id="slide-un-valor-no-es-un-nombre"> <h3 id="un-valor-no-es-un-nombre">Un <b>valor no es un nombre</b></h3> <p> De hecho, sólo las funciones pueden tener nombre para poder implementar recursividad </p> </section> <section> <p> Así que no es lo mismo el nombre <code>uno</code> que el valor <code>1</code>, y por supuesto, no es obligatoria ninguna relación coherente entre el nombre y el valor </p> <div class="org-src-container"> <pre><code class="js">let uno = 2; // para el programa tiene sentido. Puede que para el programador no
</code></pre> </div> </section> <section> <p> En general, hablando de booleanos, cadenas y números, decimos que los <b>nombres guardan valores</b> </p> <p> Si hablamos de objetos y funciones decimos que los <b>nombres apuntan a objetos o funciones</b> o <b>son referencias a objetos o funciones</b> </p> </section> <section id="slide-cadenas-de-caracteres-string"> <h3 id="cadenas-de-caracteres-string">Cadenas de caracteres (string)</h3> <ul> <li>Cadenas simples entre <code>" "</code> ó <code>' '</code></li> <li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals%3E">Cadenas de plantilla</a> entre ` `</li> </ul> <div class="org-src-container"> <pre><code class="js">let s1 = 5;
let s2 = 10;
console.log(`La suma de ${s1} y ${s2} es ${s1 + s2}.`);

// La suma de 5 y 10 es 15.
</code></pre> </div> <p> En C# se conoce como cadenas interpoladas </p> </section> </section> <section> <section id="slide-tipos-primitivos"> <h2 id="tipos-primitivos">Tipos primitivos</h2> </section> <section> <p> Se llama <b>tipos primitivos</b> a aquellos que vienen con el lenguaje y que permiten la creación de nuevos tipos más complejos </p> </section> <section id="slide-tipos-primitivos-1"> <h3 id="tipos-primitivos-1">Tipos primitivos</h3> <ul> <li>booleanos</li> <li>undefined</li> <li>números</li> <li>cadenas</li> <li>enteros grandes</li> <li>símbolos</li> </ul> </section> <section id="slide-objetos-y-null"> <h3 id="objetos-y-null">Objetos y <code>null</code></h3> <p> Los objetos en JS son "no primitivos" </p> <p> Tienen <i>datos</i> y <i>métodos</i> </p> <p> <code>null</code> es un tipo, aunque <code>typeof null ==</code> "object"= </p> </section> <section id="slide-funciones"> <h3 id="funciones">Funciones</h3> <p> Las funciones se representan por su propio tipo, aunque también son <code>object</code> </p> <p> <code>typeof f ==</code> "function"= </p> <p> Tienen la propiedad de ser "llamables" (<i>callable</i>) </p> </section> <section> <div class="org-src-container"> <pre><code class="js">// En los comentarios hay más valores posibles para cada uno de los tipos
let bool = true; // false
let number = 1234.5; // 42, -Infinity, +Infinity
let text = 'I want to be a pirate!'; // "I want to be a pirate"
let object = {}; // [], null
let code = function () { return 42; };
</code></pre> </div> </section> <section> <p> Los puedes reconocer porque responden de manera distinta al operador <code>typeof</code>: </p> <div class="org-src-container"> <pre><code class="js">typeof true;
typeof 1234.5;
typeof 'I want to be a pirate!';
typeof {};
typeof function () { return 42; };
</code></pre> </div> </section> <section> <p> En JavaScript podemos declarar una letiable y no asignarle ningún valor. En este caso el tipo de la letiable será <code>undefined</code> </p> <div class="org-src-container"> <pre><code class="js">let x;
typeof x; // undefined
x = 5;    // tan pronto como le demos un valor, el tipo dejará de ser undefined
typeof x; // number
