javascript_modelo_datos_1.reveal.org
* Objetos en JavaScript
:PROPERTIES:
:CUSTOM_ID: objetos-en-javascript
:END:

#+REVEAL: split

De entre todos los tipos, vamos a prestar atención a aquel cuyos valores
permiten la composición con otros. Es decir, los de tipo ='object'=

#+REVEAL: split

En JavaScript, los objetos son colecciones de valores etiquetados

Por ejemplo, si queremos representar el punto =(10, 15)= del plano XY
podemos etiquetar el valor en el eje X con la cadena ='x'= y el valor en
el eje Y con la cadena ='y'=

#+begin_src js
let point = { 'x': 10, 'y': 15 };
#+end_src

#+REVEAL: split

Cada par etiqueta y valor se llama *propiedad del objeto*

No es algo estricto, pero cuando se habla de las propiedades de un objeto se suele referir a los valores mientras que para hablar de las etiquetas se suele decir *nombre de la propiedad*

#+REVEAL: split

Si los nombres de las propiedades se escriben siguiendo las [[https://developer.mozilla.org/en-US/docs/Glossary/Identifier][reglas de formación de identificadores]] en JavaScript, las comillas no son necesarias

#+begin_src js
let point = { x: 10, y: 10 }; // mucho más conveniente
#+end_src

#+REVEAL: split

Este es el caso *más normal*, *el recomendado* y el que usaremos a los
largo del curso pero conviene saber que por detrás, *el nombre de la
propiedad es una cadena*

Para acceder a las propiedades de un objeto usamos los corchetes con el
nombre de la propiedad en medio:

#+begin_src js
point['x'];
point['y'];
#+end_src

#+REVEAL: split

De nuevo, si seguimos las reglas de formación de identificadores,
podemos usar la notación punto para acceder a la propiedad, mucho más
rápida de escribir:

#+begin_src js
point.x;
point.y;
#+end_src

#+REVEAL: split

Para cambiar el valor de una propiedad usamos el operador de asignación:

#+begin_src js
point.x = 0;
point.y = 0;
point['x'] = 0;
point['y'] = 0;
#+end_src

#+REVEAL: split

Si accedemos a una *propiedad que no existe*, obtendremos =undefined=:

#+begin_src js
let label = point.label; // será undefined. Compruébalo con typeof
#+end_src

#+REVEAL: split

También es verdad que en cualquier momento podemos crear propiedades
nuevas asignándoles un valor:

#+begin_src js
point.label = 'origin';
point;
#+end_src

#+REVEAL: split

** =null=
:PROPERTIES:
:CUSTOM_ID: null
:END:
Existe un último valor muy relacionado con los objetos: =null=

Tiene su propio tipo (=null= es de tipo =null=), pero la máquina virtual
dice que el =object=, por motivos históricos:

#+begin_src javascript
> typeof null;
'object' 
#+end_src

#+REVEAL: split

Este valor representa la *ausencia de objeto* y se suele utilizar para:

- En funciones en las que se pregunta por un objeto, indicar que no se
  ha encontrado
- En relaciones de composición, indicar que el objeto compuesto ya no
  necesita al objeto componente

#+REVEAL: split

Cuidado con:

=null == undefined=

=null === undefined=

#+REVEAL: split

Por ejemplo, en un RPG, preguntamos por el siguiente enemigo vivo para
comprobar si podemos seguir en batalla:

#+begin_src js
function getNextAliveEnemy() {
  let nextEnemy;
  if (aliveEnemies.length > 0) {
    nextEnemy = aliveEnemies[0];
  }
  else {
    nextEnemy = null;
  }
  return nextEnemy;
}
#+end_src

#+REVEAL: split

O bien, supón la ficha de personaje de un héroe:

#+begin_src js
let hero = { sword: null, shield: null };
hero.sword = { attack: 20, magic: 5 }; // coge una espada
hero.sword = null; // suelta la espada
#+end_src

* Arrays
:PROPERTIES:
:CUSTOM_ID: arrays
:END:

#+REVEAL: split

Las *listas* o *arrays* son colecciones de *datos ordenados*

También son =object=

Tienen una propiedad =length= y se accede a sus propiedades por índice
(número entero)

#+REVEAL: split

Los arrays en JavaScript no se parecen mucho a los arrays de bajo nivel
(C/C++), que son /muy eficientes/

Para representar datos de manera eficiente, usamos
[[https://developer.mozilla.org/es/docs/Web/JavaScript/Vectores_tipados][vectores
tipados]], que son objetos concretos que provee el API estándar

#+REVEAL: split

Por ejemplo, la lista de comandos de un menú:

#+begin_src js
let menu = ['Attack', 'Defense', 'Inventory'];
#+end_src

#+REVEAL: split

En este tipo de objetos, el orden importa

Para acceder a los distintos valores usamos su *índice* en la lista
entre corchetes. Los índices *comienzan en 0*

#+begin_src js
menu[0];
menu[1];
menu[2];
#+end_src

#+REVEAL: split

Se puede consultar la longitud de un array, accediendo a la propiedad
=length=

#+begin_src js
menu.length;
#+end_src

#+REVEAL: split

Como en el caso de los objetos que no son arrays, podemos cambiar
cualquier valor en cualquier momento usando el operador de asignación:

#+begin_src js
menu[0] = 'Special'; // reemplaza Wait con Special
#+end_src

#+REVEAL: split

También como en el caso de los objetos, podemos acceder a un valor que
no existe y recuperarlo o asignarlo en cualquier momento:

#+begin_src js
menu = ['Attack', 'Defense', 'Inventory'];
menu;
menu.length;
let item = menu[10];
typeof item; // será undefined
menu[10] = 'Secret';
menu;
menu.length;
#+end_src

#+REVEAL: split

Si asignamos a un índice *por encima de la longitud actual, extendemos
el array hasta ese índice*

#+REVEAL: split

Se puede añadir un elemento al final del array, llamando al método
[[https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/push][=push()=]]:

#+begin_src js
menu.push('Magic');
#+end_src

#+REVEAL: split

También se puede quitar un elemento por el final usando el método
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/pop][=pop()=]]:

#+begin_src js
menu.pop();
#+end_src

#+REVEAL: split

Se puede alterar una lista (insertar o borrar elementos) en cualquier
lugar usando el método
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice][=splice()=]]:

#+begin_src js
// Inspecciona la lista tras cada operación
menu.splice(2, 0, 'Magic'); // añade Magic antes de Inventory
menu.splice(2, 2, 'Ench. Inventory'); // reemplaza Magic and Inventory with Ench. Inventory
menu.splice(0, 0, 'Wait'); // añade Wait al principio de la lista
#+end_src

#+REVEAL: split

Se puede recorrer con un
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/for...of][=for...of=]]

#+begin_src js
for (let item of menu) {
  console.log(item);
}
#+end_src

#+REVEAL: split

Se pueden recorrer con un
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/forEach][=Array.forEach=]]:

#+begin_src js
menu.forEach( 
  (item) => console.log(item)
);

menu.forEach( 
  (item, index) => console.log(`${index}: ${item}`)
);
#+end_src

Ya veremos que ==>= sirve para definir una función

#+REVEAL: split

Se puede buscar un elemento y su posición en el array con =find= y
=findIndex=

Se puede comprobar si todos los elementos cumplen una condición con
=every=

Se puede crear un nuevo array con los elementos que cumplen una
condición con =filter=

Se puede crear un nuevo array aplicando una función a cada elemento con
=map=

...
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array][y
mucho más]]

