docs/javascript_modelo_datos_1.reveal.html
</code></pre> </div> </section> </section> <section> <section id="slide-objetos-en-javascript"> <h2 id="objetos-en-javascript">Objetos en JavaScript</h2> </section> <section> <p> De entre todos los tipos, vamos a prestar atención a aquel cuyos valores permiten la composición con otros. Es decir, los de tipo <code>'object'</code> </p> </section> <section> <p> En JavaScript, los objetos son colecciones de valores etiquetados </p> <p> Por ejemplo, si queremos representar el punto <code>(10, 15)</code> del plano XY podemos etiquetar el valor en el eje X con la cadena <code>'x'</code> y el valor en el eje Y con la cadena <code>'y'</code> </p> <div class="org-src-container"> <pre><code class="js">let point = { 'x': 10, 'y': 15 };
</code></pre> </div> </section> <section> <p> Cada par etiqueta y valor se llama <b>propiedad del objeto</b> </p> <p> No es algo estricto, pero cuando se habla de las propiedades de un objeto se suele referir a los valores mientras que para hablar de las etiquetas se suele decir <b>nombre de la propiedad</b> </p> </section> <section> <p> Si los nombres de las propiedades se escriben siguiendo las <a href="https://developer.mozilla.org/en-US/docs/Glossary/Identifier">reglas de formación de identificadores</a> en JavaScript, las comillas no son necesarias </p> <div class="org-src-container"> <pre><code class="js">let point = { x: 10, y: 10 }; // mucho más conveniente
</code></pre> </div> </section> <section> <p> Este es el caso <b>más normal</b>, <b>el recomendado</b> y el que usaremos a los largo del curso pero conviene saber que por detrás, <b>el nombre de la propiedad es una cadena</b> </p> <p> Para acceder a las propiedades de un objeto usamos los corchetes con el nombre de la propiedad en medio: </p> <div class="org-src-container"> <pre><code class="js">point['x'];
point['y'];
</code></pre> </div> </section> <section> <p> De nuevo, si seguimos las reglas de formación de identificadores, podemos usar la notación punto para acceder a la propiedad, mucho más rápida de escribir: </p> <div class="org-src-container"> <pre><code class="js">point.x;
point.y;
</code></pre> </div> </section> <section> <p> Para cambiar el valor de una propiedad usamos el operador de asignación: </p> <div class="org-src-container"> <pre><code class="js">point.x = 0;
point.y = 0;
point['x'] = 0;
point['y'] = 0;
</code></pre> </div> </section> <section> <p> Si accedemos a una <b>propiedad que no existe</b>, obtendremos <code>undefined</code>: </p> <div class="org-src-container"> <pre><code class="js">let label = point.label; // será undefined. Compruébalo con typeof
</code></pre> </div> </section> <section> <p> También es verdad que en cualquier momento podemos crear propiedades nuevas asignándoles un valor: </p> <div class="org-src-container"> <pre><code class="js">point.label = 'origin';
point;
</code></pre> </div> </section> <section> </section> <section id="slide-null"> <h3 id="null"><code>null</code></h3> <p> Existe un último valor muy relacionado con los objetos: <code>null</code> </p> <p> Tiene su propio tipo (<code>null</code> es de tipo <code>null</code>), pero la máquina virtual dice que el <code>object</code>, por motivos históricos: </p> <div class="org-src-container"> <pre><code class="javascript">&gt; typeof null;
'object' 
</code></pre> </div> </section> <section> <p> Este valor representa la <b>ausencia de objeto</b> y se suele utilizar para: </p> <ul> <li>En funciones en las que se pregunta por un objeto, indicar que no se ha encontrado</li> <li>En relaciones de composición, indicar que el objeto compuesto ya no necesita al objeto componente</li> </ul> </section> <section> <p> Cuidado con: </p> <p> <code>null =</code> undefined= </p> <p> <code>null ==</code> undefined= </p> </section> <section> <p> Por ejemplo, en un RPG, preguntamos por el siguiente enemigo vivo para comprobar si podemos seguir en batalla: </p> <div class="org-src-container"> <pre><code class="js">function getNextAliveEnemy() {
  let nextEnemy;
  if (aliveEnemies.length &gt; 0) {
    nextEnemy = aliveEnemies[0];
  }
  else {
    nextEnemy = null;
  }
  return nextEnemy;
}
</code></pre> </div> </section> <section> <p> O bien, supón la ficha de personaje de un héroe: </p> <div class="org-src-container"> <pre><code class="js">let hero = { sword: null, shield: null };
hero.sword = { attack: 20, magic: 5 }; // coge una espada
hero.sword = null; // suelta la espada
</code></pre> </div> </section> </section> <section> <section id="slide-arrays"> <h2 id="arrays">Arrays</h2> </section> <section> <p> Las <b>listas</b> o <b>arrays</b> son colecciones de <b>datos ordenados</b> </p> <p> También son <code>object</code> </p> <p> Tienen una propiedad <code>length</code> y se accede a sus propiedades por índice (número entero) </p> </section> <section> <p> Los arrays en JavaScript no se parecen mucho a los arrays de bajo nivel (C/C++), que son <i>muy eficientes</i> </p> <p> Para representar datos de manera eficiente, usamos <a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Vectores_tipados">vectores tipados</a>, que son objetos concretos que provee el API estándar </p> </section> <section> <p> Por ejemplo, la lista de comandos de un menú: </p> <div class="org-src-container"> <pre><code class="js">let menu = ['Attack', 'Defense', 'Inventory'];
</code></pre> </div> </section> <section> <p> En este tipo de objetos, el orden importa </p> <p> Para acceder a los distintos valores usamos su <b>índice</b> en la lista entre corchetes. Los índices <b>comienzan en 0</b> </p> <div class="org-src-container"> <pre><code class="js">menu[0];
menu[1];
menu[2];
</code></pre> </div> </section> <section> <p> Se puede consultar la longitud de un array, accediendo a la propiedad <code>length</code> </p> <div class="org-src-container"> <pre><code class="js">menu.length;
</code></pre> </div> </section> <section> <p> Como en el caso de los objetos que no son arrays, podemos cambiar cualquier valor en cualquier momento usando el operador de asignación: </p> <div class="org-src-container"> <pre><code class="js">menu[0] = 'Special'; // reemplaza Wait con Special
</code></pre> </div> </section> <section> <p> También como en el caso de los objetos, podemos acceder a un valor que no existe y recuperarlo o asignarlo en cualquier momento: </p> <div class="org-src-container"> <pre><code class="js">menu = ['Attack', 'Defense', 'Inventory'];
menu;
menu.length;
let item = menu[10];
typeof item; // será undefined
menu[10] = 'Secret';
menu;
menu.length;
</code></pre> </div> </section> <section> <p> Si asignamos a un índice <b>por encima de la longitud actual, extendemos el array hasta ese índice</b> </p> </section> <section> <p> Se puede añadir un elemento al final del array, llamando al método <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/push"><code>push()</code></a>: </p> <div class="org-src-container"> <pre><code class="js">menu.push('Magic');
</code></pre> </div> </section> <section> <p> También se puede quitar un elemento por el final usando el método <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/pop"><code>pop()</code></a>: </p> <div class="org-src-container"> <pre><code class="js">menu.pop();
</code></pre> </div> </section> <section> <p> Se puede alterar una lista (insertar o borrar elementos) en cualquier lugar usando el método <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice"><code>splice()</code></a>: </p> <div class="org-src-container"> <pre><code class="js">// Inspecciona la lista tras cada operación
menu.splice(2, 0, 'Magic'); // añade Magic antes de Inventory
menu.splice(2, 2, 'Ench. Inventory'); // reemplaza Magic and Inventory with Ench. Inventory
menu.splice(0, 0, 'Wait'); // añade Wait al principio de la lista
</code></pre> </div> </section> <section> <p> Se puede recorrer con un <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/for...of"><code>for...of</code></a> </p> <div class="org-src-container"> <pre><code class="js">for (let item of menu) {
  console.log(item);
}
</code></pre> </div> </section> <section> <p> Se pueden recorrer con un <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/forEach"><code>Array.forEach</code></a>: </p> <div class="org-src-container"> <pre><code class="js">menu.forEach( 
  (item) =&gt; console.log(item)
);

menu.forEach( 
  (item, index) =&gt; console.log(`${index}: ${item}`)
);
